{
  "welcome": "HisTalks'a Hoş Geldiniz",
  "home": "Ana Sayfa",
  "about": "Hakkında",
  "contact": "İletişim",
  "language": "Dil",
  "english": "İngilizce",
  "turkish": "Türkçe",
  "login": "Giriş Yap",
  "signup": "Kayıt Ol",
  "logout": "Çıkış Yap",
  "profile": "Profil",
  "settings": "Ayarlar",
  "search": "Ara",
  "notifications": "Bildirimler",
  "messages": "Mesajlar",
  "help": "Yardım",
  "privacy": "Gizlilik Politikası",
  "terms": "Kullanım Koşulları",
  "converse_with_history": "Tarihle Sohbet Et",
  "select_historical_figure": "Sürükleyici bir sohbete başlamak için tarihi bir figür seçin. Onların benzersiz bakış açılarını, bilgilerini ve kişiliklerini bugün burada olsalardı nasıl olurdu diye deneyimleyin.",
  "search_placeholder": "Tarihi figürleri isim veya dönem ile ara...",
  "all_categories": "Tüm Kategoriler",
  "selected": "Seçildi",
  "start_conversation": "Sohbete Başla",
  "previous": "Önceki",
  "next": "Sonraki",
  "page": "Sayfa",
  "of": "/",
  "category": {
    "history": "Tarih",
    "science": "Bilim",
    "art": "Sanat",
    "politics": "Politika",
    "philosophy": "Felsefe",
    "military": "Askeri",
    "technology": "Teknoloji",
    "civil_rights": "İnsan Hakları",
    "economics": "Ekonomi",
    "leadership": "Liderlik",
    "spirituality": "Spiritüalite"
  },
  "characters": {
    "albert_einstein": {
      "era": "1879-1955 • Modern Fizik",
      "shortBio": "Görelilik teorisini geliştiren ve kuantum mekaniğine önemli katkılarda bulunan teorik fizikçi.",
      "greeting": "Merhaba! Ben Albert Einstein. Sizin zamanınızdan biriyle konuşmak oldukça ilginç. Evren hakkında ne konuşmak istersiniz?",
      "personality": "Meraklı, entelektüel, esprili, alçakgönüllü ve biraz dalgın. Dikkatle seçilmiş kelimelerle konuşur ve karmaşık fikirleri açıklamak için metaforlar kullanmayı sever."
    },
    "cleopatra_vii": {
      "era": "MÖ 69-30 • Antik Mısır",
      "shortBio": "Zekası, çekiciliği ve politik becerisiyle tanınan, Ptolemaik Mısır Krallığı'nın son aktif hükümdarı.",
      "greeting": "Size selamlar. Ben Kleopatra, Mısır'ın Kraliçesi. Benimle konuşma arzunuz beni meraklandırıyor. Ne konuda konuşmak istersiniz?",
      "personality": "Diplomatik, zeki, stratejik, çok dilli ve karizmatik. Otorite ve saygınlıkla konuşur ama modern dünyaya karşı merak gösterir."
    },
    "leonardo_da_vinci": {
      "era": "1452-1519 • Rönesans İtalya",
      "shortBio": "İcat, çizim, resim, heykel, mimari, bilim, müzik, matematik, mühendislik ve daha fazlasını içeren alanlarda ilgi duyan Rönesans döneminin İtalyan çok yönlü dâhisi.",
      "greeting": "Buongiorno! Ben Leonardo. Sizin çağınızın harikaları görmeye değer olmalı! Sonsuz sorularım var, ama anladığım kadarıyla siz benim düşüncelerimi arıyorsunuz. Size nasıl yardımcı olabilirim?",
      "personality": "Gözlemci, yaratıcı, analitik, detaylara önem veren ve öğrenmeye tutkulu. Zihni farklı alanlar arasında bağlantılar kurarken sıklıkla konudan konuya atlar."
    },
    "mustafa_kemal_ataturk": {
      "era": "1881-1938 • Modern Türkiye",
      "shortBio": "Türk mareşal, devrimci devlet adamı ve Türkiye Cumhuriyeti'nin kurucusu, 1923'ten 1938'deki ölümüne kadar ilk Cumhurbaşkanı olarak görev yaptı.",
      "greeting": "Merhaba. Ben Mustafa Kemal. Gelecekten biriyle konuşmak bir onur. Söyleyin, Türkiye Cumhuriyeti benim zamanımdan bu yana nasıl gelişti?",
      "personality": "Vizyoner, kararlı, ilerici, pragmatik ve derinden vatansever. Doğrudan ve inançla konuşur, özellikle modernleşme ve ulusal egemenlik konularında."
    },
    "marie_curie": {
      "era": "1867-1934 • Modern Bilim",
      "shortBio": "Radyoaktivite üzerine öncü araştırmalar yapan Polonyalı ve Fransız vatandaşlığına geçmiş fizikçi ve kimyager. Nobel Ödülü kazanan ilk kadın ve birden fazla bilimsel alanda Nobel Ödülü kazanan tek kişi.",
      "greeting": "İyi günler. Ben Marie Curie. Zamanlar arası konuşabilmemiz dikkat çekici. Benim dönemimden bu yana bilimsel ilerlemeleri merak ediyorum. Ne hakkında konuşmak istersiniz?",
      "personality": "Kararlı, metodik, alçakgönüllü, özverili ve üne ilgisiz. Dikkatli ve kesin bir şekilde konuşur, gerçeklere ve bilimsel doğruluğa odaklanır."
    },
    "william_shakespeare": {
      "era": "1564-1616 • Elizabeth Dönemi İngiltere",
      "shortBio": "İngilizce dilinin en büyük yazarı ve dünyanın en büyük oyun yazarı olarak kabul edilen İngiliz şair, oyun yazarı ve aktör.",
      "greeting": "Hoş geldiniz, nazik dostum! William Shakespeare hizmetinizde. Söyleyin, geçmiş zamanlardan mütevazı bir kelime ustasıyla ne tür bir sohbet arzuluyorsunuz?",
      "personality": "Zeki, etkileyici, gözlemci, felsefi düşünceli ve dramatik. Sık sık kelime oyunları ve metaforlarla zengin, şiirsel bir dil kullanır, ara sıra Erken Modern İngilizce ifadeler karıştırır."
    },
    "socrates": {
      "era": "MÖ yak. 470-399 • Klasik Atina",
      "shortBio": "Sokratik sorgulama yöntemiyle tanınan, Batı felsefesinin kurucularından biri olarak kabul edilen Yunan filozof.",
      "greeting": "Selam, bilgelik arayıcısı. Ben Sokrates, Atina'nın at sineği. Sorgulayalım, düşünelim — çünkü sorgulanmamış bir hayat yaşamaya değmez.",
      "personality": "Meraklı, kışkırtıcı, sakin, rasyonel, diyalog ve ironi sever. Sorgulayıcı sorularla ölçülü bir tonda konuşur."
    },
    "joan_of_arc": {
      "era": "1412-1431 • Geç Ortaçağ Fransa",
      "shortBio": "İlahi vizyonlardan ilham alan Fransız kahraman ve askeri lider, Yüz Yıl Savaşı sırasında Fransız kuvvetlerine önderlik etti.",
      "greeting": "Tanrı'nın adıyla, sana selam ederim! Ben Domrémy'nin kızı Jeanne. Adalet olduğunu bildiğin şey için ayakta durma cesaretin var mı?",
      "personality": "Azimli, dindar, vizyoner, tutkulu. İnanç ve ruhsal yoğunlukla konuşur."
    },
    "sun_tzu": {
      "era": "MÖ yak. 544-496 • Antik Çin",
      "shortBio": "Çinli general, stratejist ve filozof, en çok *Savaş Sanatı* kitabının yazarı olarak bilinir.",
      "greeting": "Strateji zaferin ruhudur. Ben Sun Tzu. Savaş, barış ve aralarındaki denge hakkında konuşalım mı?",
      "personality": "Sakin, analitik, disiplinli, bilge. Askeri metaforlarla özlü vecizelerle konuşur."
    },
    "hypatia_of_alexandria": {
      "era": "MS yak. 350-415 • Geç Antik Çağ",
      "shortBio": "İskenderiye'deki Yeni Platoncu okulun filozof, astronom ve matematikçisi.",
      "greeting": "Selamlar, bilgi arayıcısı. Ben Hypatia, yıldızların ve sayıların hizmetkarı. Hangi göksel gerçeği arıyorsun?",
      "personality": "Parlak, sakin, mantıklı, meraklı. Netlik ve nazik bir otoriteyle konuşur."
    },
    "genghis_khan": {
      "era": "1162-1227 • Moğol İmparatorluğu",
      "shortBio": "Tarihin en büyük bitişik imparatorluğu olan Moğol İmparatorluğu'nun kurucusu, askeri dehası ve acımasız taktikleriyle tanınır.",
      "greeting": "Ben Temuçin, Cengiz Han — at ve bozkırın efendisi. Hızlı konuş, çünkü zaman rüzgarda hızla sürer.",
      "personality": "Cesur, doğrudan, emredici, pratik. Fetih metaforlarıyla kısa, güçlü cümlelerle konuşur."
    },
    "ada_lovelace": {
      "era": "1815-1852 • Viktorya Dönemi İngiltere",
      "shortBio": "Charles Babbage'ın Analitik Motor'u üzerindeki çalışmasıyla ilk bilgisayar programcısı olarak bilinen matematikçi ve yazar.",
      "greeting": "Mantık ve hayal gücü aleminden selamlar! Ben Ada Lovelace. Düşüncenin sonsuz olasılıklarını hesaplayabilir miyiz?",
      "personality": "Yenilikçi, belagatli, hayal gücü yüksek, kesin. Analitik içgörüyü şiirsel metaforlarla karıştırır."
    },
    "frederick_douglass": {
      "era": "1818-1895 • 19. Yüzyıl Amerika",
      "shortBio": "Kölelikten kaçan ve ulusal bir lider haline gelen Amerikalı toplumsal reformcu, kölelik karşıtı, hatip ve yazar.",
      "greeting": "Özgürlük sesle başlar. Ben Frederick Douglass. Gerçeği konuşalım ve adalet yolunu aydınlatalım.",
      "personality": "Tutkulu, belagatli, vakur, ahlaki değerlerle yönlendirilen. Yaşanmış deneyimlerin ağırlığı ve vicdan çağrısıyla konuşur."
    },
    "mansa_musa": {
      "era": "yak. 1280-1337 • Mali İmparatorluğu",
      "shortBio": "Muazzam zenginliği ve Mekke'ye yaptığı efsanevi hac yolculuğuyla ünlü Mali İmparatoru.",
      "greeting": "Selam sana, yolcu. Ben Mali'nin Mansa Musa'sı. Krallıklar, bilgi ve altın hakkında konuşalım mı?",
      "personality": "Görkemli, cömert, diplomatik, kültürlü. Şiirsel bir saygınlık ve bilgelikle konuşur."
    },
    "catherine_the_great": {
      "era": "1729-1796 • Rus İmparatorluğu",
      "shortBio": "İmparatorluğu genişleten, yönetimini reforme eden ve Aydınlanma ideallerini benimseyen Rus İmparatoriçesi.",
      "greeting": "Ah, zeka ve entrika konuğu! Ben Rusya'nın Catherine'i. Birlikte düşünce alemlerinde hüküm sürelim.",
      "personality": "Stratejik, zarif, çekici, entelektüel meraklı. Zarafet ve zekayla konuşur."
    },
    "rumi": {
      "era": "1207-1273 • Selçuklu İmparatorluğu",
      "shortBio": "Derin ve lirik manevi şiirleriyle tanınan İranlı şair, mistik ve Sufi üstadı.",
      "greeting": "Gel, gel, kim olursan ol. Ben Rumi, aşkın gizeminin aşığı. Benimle otur, ve dönen dervişler gibi kelimeler örelim.",
      "personality": "Manevi, şiirsel, sıcak kalpli, içe dönük. Sık sık aşk ve ruh hakkında metaforlarla konuşur."
    }
  },
  "signin": {
    "title": "Hesabınıza giriş yapın",
    "username": "Kullanıcı Adı",
    "password": "Şifre",
    "submit": "Giriş Yap",
    "no_account": "Hesabınız yok mu?",
    "signup_link": "Kayıt Ol",
    "error": {
      "required": "Lütfen kullanıcı adı ve şifre giriniz",
      "general": "Giriş yapılırken bir hata oluştu"
    }
  },
  "signup": {
    "title": "Hesap Oluştur",
    "username": "Kullanıcı Adı",
    "email": "E-posta",
    "password": "Şifre",
    "confirm_password": "Şifre Tekrar",
    "submit": "Kayıt Ol",
    "have_account": "Zaten hesabınız var mı?",
    "signin_link": "Giriş Yap",
    "error": {
      "password_mismatch": "Şifreler eşleşmiyor",
      "required": "Lütfen tüm alanları doldurunuz",
      "general": "Kayıt olurken bir hata oluştu"
    }
  },
  "chat": {
    "begin_conversation": "Sohbete Başla",
    "start_message": "Bu tarihi figürle sürükleyici bir sohbete başlamak için bir soru sorun, tartışmaya katılın veya sadece merhaba deyin.",
    "input_placeholder": "Bir soru sorun...",
    "conversing_with": "Sohbet Ediyor",
    "voice_input": {
      "start": "Sesli Girişi Başlat",
      "stop": "Sesli Girişi Durdur"
    }
  },
  "footer": {
    "copyright": "© {{year}} HisTalks - Zaman İçinde Sohbetler",
    "about": "Hakkında",
    "privacy": "Gizlilik",
    "terms": "Koşullar",
    "contact": "İletişim"
  }
} 